In [58]:
import pandas as pd

In [59]:
# Creating df out of a dictionary 

# Define dictionary X 

x = {'Name':['rose', 'jennie', 'kyu'], 'id':[1,2,3], 'office':['seoul','japan','USA']
}

# casting the dictionary to a DF 
df = pd.DataFrame(x)

# display the result DF 
df

     Name  id office
0    rose   1  seoul
1  jennie   2  japan
2     kyu   3    USA

In [60]:
#Retrieving the "ID" column and assigning it to a variable x
x = df[['id']]
x

   id
0   1
1   2
2   3

In [61]:
#check the type of x
type(x)

pandas.core.frame.DataFrame

In [62]:
z = df[['Name','id','office']]
z

     Name  id office
0    rose   1  seoul
1  jennie   2  japan
2     kyu   3    USA

In [63]:
# # Creating df out of a dictionary 

# # Define dictionary X 

# x = {'Name':['rose', 'jennie', 'kyu'], 'id':[1,2,3], 'office':['seoul','japan','USA']
# }

# # casting the dictionary to a DF 
# df = pd.DataFrame(x)

# # display the result DF 
# df

y = {'Student':['David','Samuel','Terry','Evan'],'Age':[25,26,27,28]}
df2 = pd.DataFrame(y)
df2

  Student  Age
0   David   25
1  Samuel   26
2   Terry   27
3    Evan   28

In [64]:
test1 = df2[['Student']]
test1

  Student
0   David
1  Samuel
2   Terry
3    Evan

In [65]:
test2 = df2[['Student','Age']]
test2

  Student  Age
0   David   25
1  Samuel   26
2   Terry   27
3    Evan   28

In [66]:
test3 = df2['Student']
test3

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [67]:
# Creating df out of a dictionary 

# Define dictionary X 

x = {'Name':['rose', 'jennie', 'kyu'], 'id':[1,2,3], 'office':['seoul','japan','USA']
}

# casting the dictionary to a DF 
df = pd.DataFrame(x)

# display the result DF 
df

     Name  id office
0    rose   1  seoul
1  jennie   2  japan
2     kyu   3    USA

In [68]:
# selecting method 
df.iloc[0,0]
df.iloc[1,0]
df.loc[0,'office']

'seoul'

In [69]:
df3 = df 
df3 = df3.set_index('Name')
df3.head() # display the first 5 rows of new df
#Now, let us access the column using the name
df3.loc['rose', 'office']

'seoul'

In [70]:
df3.loc['jennie', 'id']
df3.iloc[2,0]

3

In [ ]:
# Creating df out of a dictionary 
# Define dictionary 

AA = {'Name':['rose', 'jennie', 'kyu'], 'id':[1,2,3], 'office':['seoul','japan','USA']
}

# casting the dictionary to a DF 
df4 = pd.DataFrame(AA)

# display the result DF 
df4

df.loc[0:2,'Name':'id']

df2.loc['rose':'jennie', 'Name':'office']

     Name  id
0    rose   1
1  jennie   2
2     kyu   3

Empty DataFrame
Columns: []
Index: []